import type { Quiz } from './types'

export const quizData: Quiz[]=[
    {
        "id": 1,
        "context": "ホソアオゲイトウは何科？",
        "choices": ["ヒユ科", "イネ科", "キク科", "マメ科"],
        "correct": 0
    },
    {
        "id": 2,
        "context": "通称「猫じゃらし」として親しまれている雑草「エノコログサ」は何科？",
        "choices": ["キク科", "バラ科", "イネ科", "シソ科"],
        "correct": 2
    },
    {
        "id": 3,
        "context": "春の七草の一つであり、「ぺんぺん草」とも呼ばれる「ナズナ」は何科？",
        "choices": ["キク科", "アブラナ科", "ナデシコ科", "マメ科"],
        "correct": 1
    },
    {
        "id": 4,
        "context": "葉がハート型で、茎や葉をかじると酸っぱい味がする、庭でよく見かける雑草は？",
        "choices": ["カタバミ", "スベリヒユ", "ハコベ", "オオバコ"],
        "correct": 0
    },
    {
        "id": 5,
        "context": "道端でよく見かける「セイヨウタンポポ」は、日本の在来種と比べて花の付け根（総苞片）がどうなっているのが特徴？",
        "choices": ["上を向いてピッタリ閉じている", "鋭いトゲが生えている", "紫や赤に色づいている", "下に向いて反り返っている"],
        "correct": 3
    }
]